{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ae7541d9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Everything is set up correctly! Python can see Neo4j.\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Connection details\n",
    "URI = 'neo4j://127.0.0.1:7687'\n",
    "AUTH = (\"neo4j\", \"password\") \n",
    "\n",
    "def test_connection():\n",
    "    try:\n",
    "        # Create the driver\n",
    "        driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "        # Check if it connects\n",
    "        driver.verify_connectivity()\n",
    "        print(\"Everything is set up correctly! Python can see Neo4j.\")\n",
    "        driver.close()\n",
    "    except Exception as e:\n",
    "        print(f\"The code is right, but the database isn't responding: {e}\")\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    test_connection()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "4b4765c2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[]\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "URI = \"neo4j://127.0.0.1:7687\"\n",
    "AUTH = (\"neo4j\", \"password\")\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "\n",
    "def run_query(query):\n",
    "    with driver.session(database=\"neoj\") as session:\n",
    "        result = session.run(query)\n",
    "        return [record.data() for record in result]\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    output = run_query(\"MATCH (n) RETURN n LIMIT 5\")\n",
    "    print(output)\n",
    "    driver.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "5abdcb32",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Data created from Python successfully!\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "URI = \"neo4j://127.0.0.1:7687\"\n",
    "AUTH = (\"neo4j\", \"password\")   # change password\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "\n",
    "def create_movie(tx):\n",
    "    query = \"\"\"\n",
    "MATCH (p:Person)-[:STUDIES]->(f:Field)\n",
    "RETURN p.name AS person, f.name AS field\n",
    "\"\"\"\n",
    "    tx.run(query)\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    session.execute_write(create_movie)\n",
    "\n",
    "driver.close()\n",
    "\n",
    "print(\"Data created from Python successfully!\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e2a26a38",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "John studies Computer Science\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:STUDIES]->(f:Field)\n",
    "RETURN p.name AS person, f.name AS field\n",
    "\"\"\"\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "URI = \"neo4j://127.0.0.1:7687\"\n",
    "AUTH = (\"neo4j\", \"password\")\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "    for record in result:\n",
    "        print(record[\"person\"], \"studies\", record[\"field\"])\n",
    "\n",
    "driver.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3e3e5ca5",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "neo_env",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
